{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": [],
      "toc_visible": true,
      "authorship_tag": "ABX9TyOLJJWL6tYeFN6XUjIgbtjB",
      "include_colab_link": true
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "<a href=\"https://colab.research.google.com/github/bryanz994/neo4j-assignment/blob/main/Neo4j_Workshop_KG_Game.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "# Neo4j Workshop - Knowledge Graph Game\n",
        "\n",
        "We will use a Neo4j graph database created on the [Neo4j sandbox](https://neo4j.com/sandbox/).\n",
        "\n",
        "After creating a Neo4j sandbox instance, you can access the connection details by clicking on the top right down arrow and picking the *Connection details* tab.  \n",
        "\n",
        "You will need 2 things:\n",
        "* Password  \n",
        "* Bolt URL   \n",
        "\n",
        "<img src=\"sandbox_details.png\" alt=\"Sandbox Details\" width=\"100%\" title=\"Sandbox Details\">  "
      ],
      "metadata": {
        "id": "9AjFt714iwko"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# Install Neo4j GDS Python Client\n",
        "import sys\n",
        "!{sys.executable} -m pip install graphdatascience\n",
        "\n",
        "# Import our GDS entry point\n",
        "from graphdatascience import GraphDataScience"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "Bn2GK2B2i_H8",
        "outputId": "189a3346-5de6-4ed9-8fdb-78d935164314"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Collecting graphdatascience\n",
            "  Downloading graphdatascience-1.7-py3-none-any.whl (938 kB)\n",
            "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m938.7/938.7 kB\u001b[0m \u001b[31m6.3 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hCollecting multimethod<2.0,>=1.0 (from graphdatascience)\n",
            "  Downloading multimethod-1.9.1-py3-none-any.whl (10 kB)\n",
            "Collecting neo4j<6.0,>=4.4.2 (from graphdatascience)\n",
            "  Downloading neo4j-5.11.0.tar.gz (188 kB)\n",
            "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m188.4/188.4 kB\u001b[0m \u001b[31m5.7 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25h  Installing build dependencies ... \u001b[?25l\u001b[?25hdone\n",
            "  Getting requirements to build wheel ... \u001b[?25l\u001b[?25hdone\n",
            "  Installing backend dependencies ... \u001b[?25l\u001b[?25hdone\n",
            "  Preparing metadata (pyproject.toml) ... \u001b[?25l\u001b[?25hdone\n",
            "Requirement already satisfied: pandas<3.0,>=1.0 in /usr/local/lib/python3.10/dist-packages (from graphdatascience) (1.5.3)\n",
            "Requirement already satisfied: pyarrow<13.0,>=4.0 in /usr/local/lib/python3.10/dist-packages (from graphdatascience) (9.0.0)\n",
            "Collecting textdistance<5.0,>=4.0 (from graphdatascience)\n",
            "  Downloading textdistance-4.5.0-py3-none-any.whl (31 kB)\n",
            "Requirement already satisfied: tqdm<5.0,>=4.0 in /usr/local/lib/python3.10/dist-packages (from graphdatascience) (4.66.1)\n",
            "Requirement already satisfied: typing-extensions<5.0,>=4.0 in /usr/local/lib/python3.10/dist-packages (from graphdatascience) (4.7.1)\n",
            "Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from neo4j<6.0,>=4.4.2->graphdatascience) (2023.3)\n",
            "Requirement already satisfied: python-dateutil>=2.8.1 in /usr/local/lib/python3.10/dist-packages (from pandas<3.0,>=1.0->graphdatascience) (2.8.2)\n",
            "Requirement already satisfied: numpy>=1.21.0 in /usr/local/lib/python3.10/dist-packages (from pandas<3.0,>=1.0->graphdatascience) (1.23.5)\n",
            "Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.8.1->pandas<3.0,>=1.0->graphdatascience) (1.16.0)\n",
            "Building wheels for collected packages: neo4j\n",
            "  Building wheel for neo4j (pyproject.toml) ... \u001b[?25l\u001b[?25hdone\n",
            "  Created wheel for neo4j: filename=neo4j-5.11.0-py3-none-any.whl size=259793 sha256=fdf800689698b24fcd6bf5f2ebfb70be2b8bdb7eb038b19712d93945865fa39c\n",
            "  Stored in directory: /root/.cache/pip/wheels/5f/9b/72/d893916a92e5bd362c3c28dc8dacc060419009e5a8cebb9461\n",
            "Successfully built neo4j\n",
            "Installing collected packages: textdistance, neo4j, multimethod, graphdatascience\n",
            "Successfully installed graphdatascience-1.7 multimethod-1.9.1 neo4j-5.11.0 textdistance-4.5.0\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Instantiate your GDS Session\n",
        "\n",
        "Use Neo4j/Bolt URI and credentials according to your setup  \n",
        "\n",
        "For local standalone instance Bolt connection without auth    \n",
        "`gds = GraphDataScience(\"bolt://localhost:7687\", auth=None)`  \n",
        "\n",
        "For local standalone instance Bolt connection with auth    \n",
        "`gds = GraphDataScience(\"bolt://localhost:7687\", auth=(\"neo4j\", \"<password>\"))`  \n",
        "\n",
        "For remote cluster Neo4j connection with auth  \n",
        "`gds = GraphDataScience(\"neo4j://<FQDN or IP Address>:7687\", auth=(\"neo4j\", \"<password>\"))`  \n",
        "\n",
        "For remote standalone instance Bolt connection with auth   \n",
        "`gds = GraphDataScience(\"bolt://<FQDN or IP Address>:7687\", auth=(\"neo4j\", \"<password>\"))`"
      ],
      "metadata": {
        "id": "Phyp43jvjgkq"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# >> Update the password and the URL here <<\n",
        "gds = GraphDataScience(\"bolt://<your-ip-here>:7687\", auth=(\"neo4j\", \"<password>\"))"
      ],
      "metadata": {
        "id": "odtRg4i8j6jy"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Cleaning the database or making it ready for a rerun of the notebook.\n",
        "We are starting with a fresh clean database, however if the database was previously loaded, we have the option to clear it out first here. Then we will use it to load the data from CSV files, running [Cypher](https://neo4j.com/developer/cypher/) queries. The RELOAD_DATA flag can be used to skip this step for experimenting with different algorithms later on."
      ],
      "metadata": {
        "id": "EILLfKnszwIF"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# Set flag to control reloading of all data\n",
        "RELOAD_DATA = True\n",
        "\n",
        "\n",
        "if RELOAD_DATA: # Delete all, takes few miniutes on a full database\n",
        "  gds.run_cypher(\n",
        "      \"\"\"\n",
        "      MATCH (n) CALL {\n",
        "        WITH n\n",
        "        DETACH DELETE n\n",
        "      } IN TRANSACTIONS OF 100 ROWS;\n",
        "      \"\"\"\n",
        "  )\n",
        "else: # Run a match statement\n",
        "  gds.run_cypher(\n",
        "      \"\"\"\n",
        "      MATCH (p:Person) RETURN p;\n",
        "      \"\"\"\n",
        "  )"
      ],
      "metadata": {
        "id": "uwxU9plgzwZP"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Test reading some data\n",
        "\n",
        "Using [LOAD CSV](https://neo4j.com/docs/cypher-manual/current/clauses/load-csv/), we are loading csv files into the database, creating the graph on the fly.  \n",
        "The first cell is to test the file access, by reading it and showing only the first 5 rows.  "
      ],
      "metadata": {
        "id": "rMY2HI_b1I7u"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# Checking if we can access the education dataset\n",
        "educationListCSV=gds.run_cypher(\n",
        "\"\"\"\n",
        "LOAD CSV WITH HEADERS FROM 'https://gist.githubusercontent.com/maruthiprithivi/10b456c74ba99a35a52caaffafb9d3dc/raw/a46af9c6c4bf875ded877140c112e9ff36f8f2e8/sng_education.csv' AS row\n",
        "RETURN row.name, row.passportnumber, row.nameofinstitution, row.course, row.country, row.startyear, row.endyear limit 5;\n",
        "\"\"\"\n",
        ")\n",
        "\n",
        "# The object returned is a Pandas Data Frame, so we can explore using standard Pandas methods\n",
        "educationListCSV.head(5)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 206
        },
        "id": "s3O82QP71SU0",
        "outputId": "b97ebec8-60b9-4532-ad86-9c03d29ca877"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "     row.name row.passportnumber                 row.nameofinstitution  \\\n",
              "0  Anil Kumar         MNO9101PQR                  Raika Primary School   \n",
              "1  Anil Kumar         MNO9101PQR               Baranagar Middle School   \n",
              "2  Anil Kumar         MNO9101PQR        St George’s Junior High School   \n",
              "3  Anil Kumar         MNO9101PQR        St George’s Senior High School   \n",
              "4  Anil Kumar         MNO9101PQR  Smart National University of Vietnam   \n",
              "\n",
              "                                        row.course row.country row.startyear  \\\n",
              "0                                                -    Malaysia          1978   \n",
              "1           All India Secondary School Examination    Malaysia          1984   \n",
              "2                                                -    Malaysia          1986   \n",
              "3  All India Senior School Certificate Examination    Malaysia          1988   \n",
              "4              Bachelor of Business Administration     Vietnam          1992   \n",
              "\n",
              "  row.endyear  \n",
              "0        1983  \n",
              "1        1985  \n",
              "2        1987  \n",
              "3        1989  \n",
              "4        1995  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-a62d761c-d27f-44d1-83cf-827fe81bc019\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>row.name</th>\n",
              "      <th>row.passportnumber</th>\n",
              "      <th>row.nameofinstitution</th>\n",
              "      <th>row.course</th>\n",
              "      <th>row.country</th>\n",
              "      <th>row.startyear</th>\n",
              "      <th>row.endyear</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>Anil Kumar</td>\n",
              "      <td>MNO9101PQR</td>\n",
              "      <td>Raika Primary School</td>\n",
              "      <td>-</td>\n",
              "      <td>Malaysia</td>\n",
              "      <td>1978</td>\n",
              "      <td>1983</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>Anil Kumar</td>\n",
              "      <td>MNO9101PQR</td>\n",
              "      <td>Baranagar Middle School</td>\n",
              "      <td>All India Secondary School Examination</td>\n",
              "      <td>Malaysia</td>\n",
              "      <td>1984</td>\n",
              "      <td>1985</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>Anil Kumar</td>\n",
              "      <td>MNO9101PQR</td>\n",
              "      <td>St George’s Junior High School</td>\n",
              "      <td>-</td>\n",
              "      <td>Malaysia</td>\n",
              "      <td>1986</td>\n",
              "      <td>1987</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>Anil Kumar</td>\n",
              "      <td>MNO9101PQR</td>\n",
              "      <td>St George’s Senior High School</td>\n",
              "      <td>All India Senior School Certificate Examination</td>\n",
              "      <td>Malaysia</td>\n",
              "      <td>1988</td>\n",
              "      <td>1989</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>Anil Kumar</td>\n",
              "      <td>MNO9101PQR</td>\n",
              "      <td>Smart National University of Vietnam</td>\n",
              "      <td>Bachelor of Business Administration</td>\n",
              "      <td>Vietnam</td>\n",
              "      <td>1992</td>\n",
              "      <td>1995</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-a62d761c-d27f-44d1-83cf-827fe81bc019')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-a62d761c-d27f-44d1-83cf-827fe81bc019 button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-a62d761c-d27f-44d1-83cf-827fe81bc019');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-ec6ae398-ee6a-4722-b5f4-55b4f4c6f342\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-ec6ae398-ee6a-4722-b5f4-55b4f4c6f342')\"\n",
              "            title=\"Suggest charts.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "    background-color: #E8F0FE;\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: #1967D2;\n",
              "    height: 32px;\n",
              "    padding: 0 0 0 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: #E2EBFA;\n",
              "    box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: #174EA6;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "    background-color: #3B4455;\n",
              "    fill: #D2E3FC;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart:hover {\n",
              "    background-color: #434B5C;\n",
              "    box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "    filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "    fill: #FFFFFF;\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const charts = await google.colab.kernel.invokeFunction(\n",
              "          'suggestCharts', [key], {});\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-ec6ae398-ee6a-4722-b5f4-55b4f4c6f342 button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "    </div>\n",
              "  </div>\n"
            ]
          },
          "metadata": {},
          "execution_count": 6
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Checking if we can access the employment dataset\n",
        "employmentListCSV=gds.run_cypher(\n",
        "\"\"\"\n",
        "LOAD CSV WITH HEADERS FROM 'https://gist.githubusercontent.com/maruthiprithivi/10b456c74ba99a35a52caaffafb9d3dc/raw/a46af9c6c4bf875ded877140c112e9ff36f8f2e8/sng_work.csv' AS row\n",
        "RETURN row.passportnumber, row.designation, row.nameoforganization limit 5;\n",
        "\"\"\"\n",
        ")\n",
        "\n",
        "# The object returned is a Pandas Data Frame, so we can explore using standard Pandas methods\n",
        "employmentListCSV.head(5)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 206
        },
        "id": "y_25fDLxsAIW",
        "outputId": "b314b720-5067-475b-a6a9-bfae4ef08658"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "  row.passportnumber                                    row.designation  \\\n",
              "0         ABC1234DEF                    Vice President Global Marketing   \n",
              "1         ABC1234DEF                  Vice President Regional Marketing   \n",
              "2         ABC1234DEF                          Senior Marketing Director   \n",
              "3         GHI5678JKL                           Founding Editor in Chief   \n",
              "4         GHI5678JKL  Director and Chairman of the Higher Education ...   \n",
              "\n",
              "                           row.nameoforganization  \n",
              "0                              Moon Microsystems   \n",
              "1                                 PA Technologies  \n",
              "2                                Ultimate Pte Ltd  \n",
              "3  Journal of Engineering Science and Technology   \n",
              "4           British Malaysian Chamber of Commerce  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-9d3ac7cd-f4d2-4460-9a21-b93c9e0573c1\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>row.passportnumber</th>\n",
              "      <th>row.designation</th>\n",
              "      <th>row.nameoforganization</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>Vice President Global Marketing</td>\n",
              "      <td>Moon Microsystems</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>Vice President Regional Marketing</td>\n",
              "      <td>PA Technologies</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>Senior Marketing Director</td>\n",
              "      <td>Ultimate Pte Ltd</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>GHI5678JKL</td>\n",
              "      <td>Founding Editor in Chief</td>\n",
              "      <td>Journal of Engineering Science and Technology</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>GHI5678JKL</td>\n",
              "      <td>Director and Chairman of the Higher Education ...</td>\n",
              "      <td>British Malaysian Chamber of Commerce</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-9d3ac7cd-f4d2-4460-9a21-b93c9e0573c1')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-9d3ac7cd-f4d2-4460-9a21-b93c9e0573c1 button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-9d3ac7cd-f4d2-4460-9a21-b93c9e0573c1');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-2a724ea4-9aa0-45eb-8b92-79bf3f946fff\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-2a724ea4-9aa0-45eb-8b92-79bf3f946fff')\"\n",
              "            title=\"Suggest charts.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "    background-color: #E8F0FE;\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: #1967D2;\n",
              "    height: 32px;\n",
              "    padding: 0 0 0 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: #E2EBFA;\n",
              "    box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: #174EA6;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "    background-color: #3B4455;\n",
              "    fill: #D2E3FC;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart:hover {\n",
              "    background-color: #434B5C;\n",
              "    box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "    filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "    fill: #FFFFFF;\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const charts = await google.colab.kernel.invokeFunction(\n",
              "          'suggestCharts', [key], {});\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-2a724ea4-9aa0-45eb-8b92-79bf3f946fff button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "    </div>\n",
              "  </div>\n"
            ]
          },
          "metadata": {},
          "execution_count": 8
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Checking if we can access the travel dataset\n",
        "travelListCSV=gds.run_cypher(\n",
        "\"\"\"\n",
        "LOAD CSV WITH HEADERS FROM 'https://gist.githubusercontent.com/maruthiprithivi/10b456c74ba99a35a52caaffafb9d3dc/raw/a46af9c6c4bf875ded877140c112e9ff36f8f2e8/sng_trips.csv' AS row\n",
        "RETURN row.passportnumber, row.citizenship, row.arrivalcountry, row.departuredate, row.arrivaldate  limit 5;\n",
        "\"\"\"\n",
        ")\n",
        "\n",
        "# The object returned is a Pandas Data Frame, so we can explore using standard Pandas methods\n",
        "travelListCSV.head(5)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 206
        },
        "id": "7aL4HnJ0sXmB",
        "outputId": "58209436-75f8-4cdf-9da2-99ee65b9e99f"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "  row.passportnumber row.citizenship row.arrivalcountry  \\\n",
              "0         ABC1234DEF      Singapore              Hawaii   \n",
              "1         ABC1234DEF      Singapore          Indonesia    \n",
              "2         ABC1234DEF      Singapore               Korea   \n",
              "3         ABC1234DEF      Singapore             Vietnam   \n",
              "4         ABC1234DEF      Singapore               Dubai   \n",
              "\n",
              "            row.departuredate             row.arrivaldate  \n",
              "0     Thursday, 12 April 2018     Thursday, 12 April 2018  \n",
              "1         Sunday, 2 June 2019         Sunday, 2 June 2019  \n",
              "2       Friday, 12 March 2021       Friday, 12 March 2021  \n",
              "3   Sunday, 26 September 2021   Sunday, 26 September 2021  \n",
              "4  Saturday, 11 December 2021  Saturday, 11 December 2021  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-c81b9397-f1bd-4261-89b9-5ed0cbac2aca\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>row.passportnumber</th>\n",
              "      <th>row.citizenship</th>\n",
              "      <th>row.arrivalcountry</th>\n",
              "      <th>row.departuredate</th>\n",
              "      <th>row.arrivaldate</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>Singapore</td>\n",
              "      <td>Hawaii</td>\n",
              "      <td>Thursday, 12 April 2018</td>\n",
              "      <td>Thursday, 12 April 2018</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>Singapore</td>\n",
              "      <td>Indonesia</td>\n",
              "      <td>Sunday, 2 June 2019</td>\n",
              "      <td>Sunday, 2 June 2019</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>Singapore</td>\n",
              "      <td>Korea</td>\n",
              "      <td>Friday, 12 March 2021</td>\n",
              "      <td>Friday, 12 March 2021</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>Singapore</td>\n",
              "      <td>Vietnam</td>\n",
              "      <td>Sunday, 26 September 2021</td>\n",
              "      <td>Sunday, 26 September 2021</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>Singapore</td>\n",
              "      <td>Dubai</td>\n",
              "      <td>Saturday, 11 December 2021</td>\n",
              "      <td>Saturday, 11 December 2021</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-c81b9397-f1bd-4261-89b9-5ed0cbac2aca')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-c81b9397-f1bd-4261-89b9-5ed0cbac2aca button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-c81b9397-f1bd-4261-89b9-5ed0cbac2aca');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-f0313cdd-a2f9-466d-9df6-a3c6aa4c7850\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-f0313cdd-a2f9-466d-9df6-a3c6aa4c7850')\"\n",
              "            title=\"Suggest charts.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "    background-color: #E8F0FE;\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: #1967D2;\n",
              "    height: 32px;\n",
              "    padding: 0 0 0 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: #E2EBFA;\n",
              "    box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: #174EA6;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "    background-color: #3B4455;\n",
              "    fill: #D2E3FC;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart:hover {\n",
              "    background-color: #434B5C;\n",
              "    box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "    filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "    fill: #FFFFFF;\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const charts = await google.colab.kernel.invokeFunction(\n",
              "          'suggestCharts', [key], {});\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-f0313cdd-a2f9-466d-9df6-a3c6aa4c7850 button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "    </div>\n",
              "  </div>\n"
            ]
          },
          "metadata": {},
          "execution_count": 9
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Checking if we can access the transactions data set\n",
        "transactionListCSV=gds.run_cypher(\n",
        "\"\"\"\n",
        "LOAD CSV WITH HEADERS FROM 'https://gist.githubusercontent.com/maruthiprithivi/10b456c74ba99a35a52caaffafb9d3dc/raw/a46af9c6c4bf875ded877140c112e9ff36f8f2e8/sng_transaction.csv' AS row\n",
        "RETURN row.passportnumber, row.cardnumber, row.country, row.merchant, row.amount limit 5;\n",
        "\"\"\"\n",
        ")\n",
        "\n",
        "# The object returned is a Pandas Data Frame, so we can explore using standard Pandas methods\n",
        "transactionListCSV.head(5)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 206
        },
        "id": "Gvnj1IWEshAz",
        "outputId": "0bdc165f-b977-4767-a95c-2bbfba216776"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "  row.passportnumber             row.cardnumber row.country  \\\n",
              "0         ABC1234DEF  2345-6789-1011 -1213-1415   Singapore   \n",
              "1         ABC1234DEF  2345-6789-1011 -1213-1415   Singapore   \n",
              "2         ABC1234DEF  2345-6789-1011 -1213-1415   Singapore   \n",
              "3         ABC1234DEF  2345-6789-1011 -1213-1415   Singapore   \n",
              "4         ABC1234DEF  2345-6789-1011 -1213-1415   Singapore   \n",
              "\n",
              "                 row.merchant row.amount  \n",
              "0  5 SENSES BISTRO, SINGAPORE     $40.35  \n",
              "1            A.LAB, SINGAPORE    $250.22  \n",
              "2         B*DAZZLE, SINGAPORE     $22.50  \n",
              "3      CAFE KURIKO, SINGAPORE     $12.95  \n",
              "4      DDM FASHION, SINGAPORE     $55.85  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-6344c9a3-92b5-4ad0-a2f9-d26aa0f0538b\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>row.passportnumber</th>\n",
              "      <th>row.cardnumber</th>\n",
              "      <th>row.country</th>\n",
              "      <th>row.merchant</th>\n",
              "      <th>row.amount</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>2345-6789-1011 -1213-1415</td>\n",
              "      <td>Singapore</td>\n",
              "      <td>5 SENSES BISTRO, SINGAPORE</td>\n",
              "      <td>$40.35</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>2345-6789-1011 -1213-1415</td>\n",
              "      <td>Singapore</td>\n",
              "      <td>A.LAB, SINGAPORE</td>\n",
              "      <td>$250.22</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>2345-6789-1011 -1213-1415</td>\n",
              "      <td>Singapore</td>\n",
              "      <td>B*DAZZLE, SINGAPORE</td>\n",
              "      <td>$22.50</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>2345-6789-1011 -1213-1415</td>\n",
              "      <td>Singapore</td>\n",
              "      <td>CAFE KURIKO, SINGAPORE</td>\n",
              "      <td>$12.95</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>ABC1234DEF</td>\n",
              "      <td>2345-6789-1011 -1213-1415</td>\n",
              "      <td>Singapore</td>\n",
              "      <td>DDM FASHION, SINGAPORE</td>\n",
              "      <td>$55.85</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-6344c9a3-92b5-4ad0-a2f9-d26aa0f0538b')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-6344c9a3-92b5-4ad0-a2f9-d26aa0f0538b button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-6344c9a3-92b5-4ad0-a2f9-d26aa0f0538b');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-2e77a1a4-4017-4243-831d-ff718f217956\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-2e77a1a4-4017-4243-831d-ff718f217956')\"\n",
              "            title=\"Suggest charts.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "    background-color: #E8F0FE;\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: #1967D2;\n",
              "    height: 32px;\n",
              "    padding: 0 0 0 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: #E2EBFA;\n",
              "    box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: #174EA6;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "    background-color: #3B4455;\n",
              "    fill: #D2E3FC;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart:hover {\n",
              "    background-color: #434B5C;\n",
              "    box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "    filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "    fill: #FFFFFF;\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const charts = await google.colab.kernel.invokeFunction(\n",
              "          'suggestCharts', [key], {});\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-2e77a1a4-4017-4243-831d-ff718f217956 button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "    </div>\n",
              "  </div>\n"
            ]
          },
          "metadata": {},
          "execution_count": 11
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Creating constraints and indexes\n",
        "\n",
        "For data integrity, we will create [constraints](https://neo4j.com/docs/cypher-manual/current/constraints/) to have a robust graph data model. Each constraint enforces uniqueness of an identifier for a given label. An index is also created for the name property on Client nodes, this allows fast lookups when querying clients by name."
      ],
      "metadata": {
        "id": "zK7XDe431RoB"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# Create index and constraint\n",
        "CONSTRAINTS = [\n",
        "    \"CREATE CONSTRAINT personPassportNumberConstraint IF NOT EXISTS FOR (p:Person) REQUIRE p.passportnumber IS UNIQUE;\",\n",
        "    \"CREATE CONSTRAINT countryNameConstraint IF NOT EXISTS FOR (c:Country) REQUIRE c.name IS UNIQUE;\",\n",
        "    \"CREATE CONSTRAINT institutionNameConstraint IF NOT EXISTS FOR (i:Institution) REQUIRE i.name IS UNIQUE;\",\n",
        "    \"CREATE CONSTRAINT merchantNameConstraint IF NOT EXISTS FOR (m:Merchant) REQUIRE m.name IS UNIQUE;\",\n",
        "    \"CREATE INDEX organizationNameConstraint IF NOT EXISTS FOR (o:Organization) ON o.organization;\"\n",
        "]\n",
        "\n",
        "for c in CONSTRAINTS:\n",
        "    gds.run_cypher(c)"
      ],
      "metadata": {
        "id": "RaIBxcW1jZGA"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# Verify constraint created\n",
        "gds.run_cypher(\"SHOW CONSTRAINTS\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 520
        },
        "id": "HcwcoKuLvEIV",
        "outputId": "4f1cebbd-d096-4d9e-d010-93ad3cdac756"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "    id                            name        type entityType  labelsOrTypes  \\\n",
              "0   14                  BankConstraint  UNIQUENESS       NODE         [Bank]   \n",
              "1   18                CashInConstraint  UNIQUENESS       NODE       [CashIn]   \n",
              "2   20               CashOutConstraint  UNIQUENESS       NODE      [CashOut]   \n",
              "3    4                ClientConstraint  UNIQUENESS       NODE       [Client]   \n",
              "4    6                 EmailConstraint  UNIQUENESS       NODE        [Email]   \n",
              "5   12              MerchantConstraint  UNIQUENESS       NODE     [Merchant]   \n",
              "6   24               PaymentConstraint  UNIQUENESS       NODE      [Payment]   \n",
              "7    8                 PhoneConstraint  UNIQUENESS       NODE        [Phone]   \n",
              "8   10                   SSNConstraint  UNIQUENESS       NODE          [SSN]   \n",
              "9   16           TransactionConstraint  UNIQUENESS       NODE  [Transaction]   \n",
              "10  22              TransferConstraint  UNIQUENESS       NODE     [Transfer]   \n",
              "11  30           countryNameConstraint  UNIQUENESS       NODE      [Country]   \n",
              "12  32       institutionNameConstraint  UNIQUENESS       NODE  [Institution]   \n",
              "13  34          merchantNameConstraint  UNIQUENESS       NODE     [Merchant]   \n",
              "14  28  personPassportNumberConstraint  UNIQUENESS       NODE       [Person]   \n",
              "\n",
              "          properties                      ownedIndex propertyType  \n",
              "0               [id]                  BankConstraint         None  \n",
              "1       [globalStep]                CashInConstraint         None  \n",
              "2       [globalStep]               CashOutConstraint         None  \n",
              "3               [id]                ClientConstraint         None  \n",
              "4            [email]                 EmailConstraint         None  \n",
              "5               [id]              MerchantConstraint         None  \n",
              "6       [globalStep]               PaymentConstraint         None  \n",
              "7      [phoneNumber]                 PhoneConstraint         None  \n",
              "8              [ssn]                   SSNConstraint         None  \n",
              "9       [globalStep]           TransactionConstraint         None  \n",
              "10      [globalStep]              TransferConstraint         None  \n",
              "11            [name]           countryNameConstraint         None  \n",
              "12            [name]       institutionNameConstraint         None  \n",
              "13            [name]          merchantNameConstraint         None  \n",
              "14  [passportnumber]  personPassportNumberConstraint         None  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-454b0d00-4551-4cf3-a7ad-100e11923e71\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>id</th>\n",
              "      <th>name</th>\n",
              "      <th>type</th>\n",
              "      <th>entityType</th>\n",
              "      <th>labelsOrTypes</th>\n",
              "      <th>properties</th>\n",
              "      <th>ownedIndex</th>\n",
              "      <th>propertyType</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>14</td>\n",
              "      <td>BankConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Bank]</td>\n",
              "      <td>[id]</td>\n",
              "      <td>BankConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>18</td>\n",
              "      <td>CashInConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[CashIn]</td>\n",
              "      <td>[globalStep]</td>\n",
              "      <td>CashInConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>20</td>\n",
              "      <td>CashOutConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[CashOut]</td>\n",
              "      <td>[globalStep]</td>\n",
              "      <td>CashOutConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>4</td>\n",
              "      <td>ClientConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Client]</td>\n",
              "      <td>[id]</td>\n",
              "      <td>ClientConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>6</td>\n",
              "      <td>EmailConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Email]</td>\n",
              "      <td>[email]</td>\n",
              "      <td>EmailConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>12</td>\n",
              "      <td>MerchantConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Merchant]</td>\n",
              "      <td>[id]</td>\n",
              "      <td>MerchantConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>24</td>\n",
              "      <td>PaymentConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Payment]</td>\n",
              "      <td>[globalStep]</td>\n",
              "      <td>PaymentConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>8</td>\n",
              "      <td>PhoneConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Phone]</td>\n",
              "      <td>[phoneNumber]</td>\n",
              "      <td>PhoneConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>10</td>\n",
              "      <td>SSNConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[SSN]</td>\n",
              "      <td>[ssn]</td>\n",
              "      <td>SSNConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>16</td>\n",
              "      <td>TransactionConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Transaction]</td>\n",
              "      <td>[globalStep]</td>\n",
              "      <td>TransactionConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>10</th>\n",
              "      <td>22</td>\n",
              "      <td>TransferConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Transfer]</td>\n",
              "      <td>[globalStep]</td>\n",
              "      <td>TransferConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>11</th>\n",
              "      <td>30</td>\n",
              "      <td>countryNameConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Country]</td>\n",
              "      <td>[name]</td>\n",
              "      <td>countryNameConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>12</th>\n",
              "      <td>32</td>\n",
              "      <td>institutionNameConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Institution]</td>\n",
              "      <td>[name]</td>\n",
              "      <td>institutionNameConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>13</th>\n",
              "      <td>34</td>\n",
              "      <td>merchantNameConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Merchant]</td>\n",
              "      <td>[name]</td>\n",
              "      <td>merchantNameConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>14</th>\n",
              "      <td>28</td>\n",
              "      <td>personPassportNumberConstraint</td>\n",
              "      <td>UNIQUENESS</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Person]</td>\n",
              "      <td>[passportnumber]</td>\n",
              "      <td>personPassportNumberConstraint</td>\n",
              "      <td>None</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-454b0d00-4551-4cf3-a7ad-100e11923e71')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-454b0d00-4551-4cf3-a7ad-100e11923e71 button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-454b0d00-4551-4cf3-a7ad-100e11923e71');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-cd1caa1d-5b3c-412a-a66a-23dc73260799\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-cd1caa1d-5b3c-412a-a66a-23dc73260799')\"\n",
              "            title=\"Suggest charts.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "    background-color: #E8F0FE;\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: #1967D2;\n",
              "    height: 32px;\n",
              "    padding: 0 0 0 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: #E2EBFA;\n",
              "    box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: #174EA6;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "    background-color: #3B4455;\n",
              "    fill: #D2E3FC;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart:hover {\n",
              "    background-color: #434B5C;\n",
              "    box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "    filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "    fill: #FFFFFF;\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const charts = await google.colab.kernel.invokeFunction(\n",
              "          'suggestCharts', [key], {});\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-cd1caa1d-5b3c-412a-a66a-23dc73260799 button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "    </div>\n",
              "  </div>\n"
            ]
          },
          "metadata": {},
          "execution_count": 13
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Verify index created\n",
        "gds.run_cypher(\"SHOW INDEX\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 957
        },
        "id": "Ejl3IHxNvYzZ",
        "outputId": "6e970e68-4f0b-4891-cb34-89c2ebdd052b"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "    id                            name   state  populationPercent    type  \\\n",
              "0   13                  BankConstraint  ONLINE              100.0   RANGE   \n",
              "1   17                CashInConstraint  ONLINE              100.0   RANGE   \n",
              "2   19               CashOutConstraint  ONLINE              100.0   RANGE   \n",
              "3    3                ClientConstraint  ONLINE              100.0   RANGE   \n",
              "4   26                ClientFraudIndex  ONLINE              100.0   RANGE   \n",
              "5   25                 ClientNameIndex  ONLINE              100.0   RANGE   \n",
              "6    5                 EmailConstraint  ONLINE              100.0   RANGE   \n",
              "7   11              MerchantConstraint  ONLINE              100.0   RANGE   \n",
              "8   23               PaymentConstraint  ONLINE              100.0   RANGE   \n",
              "9    7                 PhoneConstraint  ONLINE              100.0   RANGE   \n",
              "10   9                   SSNConstraint  ONLINE              100.0   RANGE   \n",
              "11  15           TransactionConstraint  ONLINE              100.0   RANGE   \n",
              "12  21              TransferConstraint  ONLINE              100.0   RANGE   \n",
              "13  29           countryNameConstraint  ONLINE              100.0   RANGE   \n",
              "14   1                  index_343aff4e  ONLINE              100.0  LOOKUP   \n",
              "15   2                  index_f7700477  ONLINE              100.0  LOOKUP   \n",
              "16  31       institutionNameConstraint  ONLINE              100.0   RANGE   \n",
              "17  33          merchantNameConstraint  ONLINE              100.0   RANGE   \n",
              "18  35      organizationNameConstraint  ONLINE              100.0   RANGE   \n",
              "19  27  personPassportNumberConstraint  ONLINE              100.0   RANGE   \n",
              "\n",
              "      entityType   labelsOrTypes        properties     indexProvider  \\\n",
              "0           NODE          [Bank]              [id]         range-1.0   \n",
              "1           NODE        [CashIn]      [globalStep]         range-1.0   \n",
              "2           NODE       [CashOut]      [globalStep]         range-1.0   \n",
              "3           NODE        [Client]              [id]         range-1.0   \n",
              "4           NODE        [Client]     [fraud_group]         range-1.0   \n",
              "5           NODE        [Client]            [name]         range-1.0   \n",
              "6           NODE         [Email]           [email]         range-1.0   \n",
              "7           NODE      [Merchant]              [id]         range-1.0   \n",
              "8           NODE       [Payment]      [globalStep]         range-1.0   \n",
              "9           NODE         [Phone]     [phoneNumber]         range-1.0   \n",
              "10          NODE           [SSN]             [ssn]         range-1.0   \n",
              "11          NODE   [Transaction]      [globalStep]         range-1.0   \n",
              "12          NODE      [Transfer]      [globalStep]         range-1.0   \n",
              "13          NODE       [Country]            [name]         range-1.0   \n",
              "14          NODE            None              None  token-lookup-1.0   \n",
              "15  RELATIONSHIP            None              None  token-lookup-1.0   \n",
              "16          NODE   [Institution]            [name]         range-1.0   \n",
              "17          NODE      [Merchant]            [name]         range-1.0   \n",
              "18          NODE  [Organization]    [organization]         range-1.0   \n",
              "19          NODE        [Person]  [passportnumber]         range-1.0   \n",
              "\n",
              "                  owningConstraint                             lastRead  \\\n",
              "0                   BankConstraint  2023-08-24T07:00:27.490000000+00:00   \n",
              "1                 CashInConstraint  2023-08-24T07:02:21.197000000+00:00   \n",
              "2                CashOutConstraint  2023-08-24T07:02:58.201000000+00:00   \n",
              "3                 ClientConstraint  2023-08-24T07:45:46.395000000+00:00   \n",
              "4                             None  2023-08-24T07:46:22.896000000+00:00   \n",
              "5                             None  2023-08-24T07:28:52.871000000+00:00   \n",
              "6                  EmailConstraint  2023-08-24T07:00:18.985000000+00:00   \n",
              "7               MerchantConstraint  2023-08-24T07:03:40.583000000+00:00   \n",
              "8                PaymentConstraint  2023-08-24T07:03:40.583000000+00:00   \n",
              "9                  PhoneConstraint  2023-08-24T07:00:18.884000000+00:00   \n",
              "10                   SSNConstraint  2023-08-24T07:00:18.904000000+00:00   \n",
              "11           TransactionConstraint  2023-08-24T07:04:00.315000000+00:00   \n",
              "12              TransferConstraint  2023-08-24T07:04:00.315000000+00:00   \n",
              "13           countryNameConstraint                                 None   \n",
              "14                            None  2023-08-24T07:46:28.978000000+00:00   \n",
              "15                            None  2023-08-24T07:46:29.195000000+00:00   \n",
              "16       institutionNameConstraint                                 None   \n",
              "17          merchantNameConstraint                                 None   \n",
              "18                            None                                 None   \n",
              "19  personPassportNumberConstraint                                 None   \n",
              "\n",
              "    readCount  \n",
              "0        2246  \n",
              "1      211659  \n",
              "2      112407  \n",
              "3      170063  \n",
              "4          29  \n",
              "5           1  \n",
              "6        3289  \n",
              "7      144218  \n",
              "8      107238  \n",
              "9        3291  \n",
              "10       3301  \n",
              "11     466896  \n",
              "12      28878  \n",
              "13          0  \n",
              "14         25  \n",
              "15          1  \n",
              "16          0  \n",
              "17          0  \n",
              "18          0  \n",
              "19          0  "
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-82a066e5-ef41-4720-8a05-bda30097bac4\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>id</th>\n",
              "      <th>name</th>\n",
              "      <th>state</th>\n",
              "      <th>populationPercent</th>\n",
              "      <th>type</th>\n",
              "      <th>entityType</th>\n",
              "      <th>labelsOrTypes</th>\n",
              "      <th>properties</th>\n",
              "      <th>indexProvider</th>\n",
              "      <th>owningConstraint</th>\n",
              "      <th>lastRead</th>\n",
              "      <th>readCount</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>13</td>\n",
              "      <td>BankConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Bank]</td>\n",
              "      <td>[id]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>BankConstraint</td>\n",
              "      <td>2023-08-24T07:00:27.490000000+00:00</td>\n",
              "      <td>2246</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>17</td>\n",
              "      <td>CashInConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[CashIn]</td>\n",
              "      <td>[globalStep]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>CashInConstraint</td>\n",
              "      <td>2023-08-24T07:02:21.197000000+00:00</td>\n",
              "      <td>211659</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>19</td>\n",
              "      <td>CashOutConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[CashOut]</td>\n",
              "      <td>[globalStep]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>CashOutConstraint</td>\n",
              "      <td>2023-08-24T07:02:58.201000000+00:00</td>\n",
              "      <td>112407</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>3</td>\n",
              "      <td>ClientConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Client]</td>\n",
              "      <td>[id]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>ClientConstraint</td>\n",
              "      <td>2023-08-24T07:45:46.395000000+00:00</td>\n",
              "      <td>170063</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>26</td>\n",
              "      <td>ClientFraudIndex</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Client]</td>\n",
              "      <td>[fraud_group]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>None</td>\n",
              "      <td>2023-08-24T07:46:22.896000000+00:00</td>\n",
              "      <td>29</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>25</td>\n",
              "      <td>ClientNameIndex</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Client]</td>\n",
              "      <td>[name]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>None</td>\n",
              "      <td>2023-08-24T07:28:52.871000000+00:00</td>\n",
              "      <td>1</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>5</td>\n",
              "      <td>EmailConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Email]</td>\n",
              "      <td>[email]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>EmailConstraint</td>\n",
              "      <td>2023-08-24T07:00:18.985000000+00:00</td>\n",
              "      <td>3289</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>11</td>\n",
              "      <td>MerchantConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Merchant]</td>\n",
              "      <td>[id]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>MerchantConstraint</td>\n",
              "      <td>2023-08-24T07:03:40.583000000+00:00</td>\n",
              "      <td>144218</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>23</td>\n",
              "      <td>PaymentConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Payment]</td>\n",
              "      <td>[globalStep]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>PaymentConstraint</td>\n",
              "      <td>2023-08-24T07:03:40.583000000+00:00</td>\n",
              "      <td>107238</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>7</td>\n",
              "      <td>PhoneConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Phone]</td>\n",
              "      <td>[phoneNumber]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>PhoneConstraint</td>\n",
              "      <td>2023-08-24T07:00:18.884000000+00:00</td>\n",
              "      <td>3291</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>10</th>\n",
              "      <td>9</td>\n",
              "      <td>SSNConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[SSN]</td>\n",
              "      <td>[ssn]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>SSNConstraint</td>\n",
              "      <td>2023-08-24T07:00:18.904000000+00:00</td>\n",
              "      <td>3301</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>11</th>\n",
              "      <td>15</td>\n",
              "      <td>TransactionConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Transaction]</td>\n",
              "      <td>[globalStep]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>TransactionConstraint</td>\n",
              "      <td>2023-08-24T07:04:00.315000000+00:00</td>\n",
              "      <td>466896</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>12</th>\n",
              "      <td>21</td>\n",
              "      <td>TransferConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Transfer]</td>\n",
              "      <td>[globalStep]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>TransferConstraint</td>\n",
              "      <td>2023-08-24T07:04:00.315000000+00:00</td>\n",
              "      <td>28878</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>13</th>\n",
              "      <td>29</td>\n",
              "      <td>countryNameConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Country]</td>\n",
              "      <td>[name]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>countryNameConstraint</td>\n",
              "      <td>None</td>\n",
              "      <td>0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>14</th>\n",
              "      <td>1</td>\n",
              "      <td>index_343aff4e</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>LOOKUP</td>\n",
              "      <td>NODE</td>\n",
              "      <td>None</td>\n",
              "      <td>None</td>\n",
              "      <td>token-lookup-1.0</td>\n",
              "      <td>None</td>\n",
              "      <td>2023-08-24T07:46:28.978000000+00:00</td>\n",
              "      <td>25</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>15</th>\n",
              "      <td>2</td>\n",
              "      <td>index_f7700477</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>LOOKUP</td>\n",
              "      <td>RELATIONSHIP</td>\n",
              "      <td>None</td>\n",
              "      <td>None</td>\n",
              "      <td>token-lookup-1.0</td>\n",
              "      <td>None</td>\n",
              "      <td>2023-08-24T07:46:29.195000000+00:00</td>\n",
              "      <td>1</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>16</th>\n",
              "      <td>31</td>\n",
              "      <td>institutionNameConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Institution]</td>\n",
              "      <td>[name]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>institutionNameConstraint</td>\n",
              "      <td>None</td>\n",
              "      <td>0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>17</th>\n",
              "      <td>33</td>\n",
              "      <td>merchantNameConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Merchant]</td>\n",
              "      <td>[name]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>merchantNameConstraint</td>\n",
              "      <td>None</td>\n",
              "      <td>0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>18</th>\n",
              "      <td>35</td>\n",
              "      <td>organizationNameConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Organization]</td>\n",
              "      <td>[organization]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>None</td>\n",
              "      <td>None</td>\n",
              "      <td>0</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>19</th>\n",
              "      <td>27</td>\n",
              "      <td>personPassportNumberConstraint</td>\n",
              "      <td>ONLINE</td>\n",
              "      <td>100.0</td>\n",
              "      <td>RANGE</td>\n",
              "      <td>NODE</td>\n",
              "      <td>[Person]</td>\n",
              "      <td>[passportnumber]</td>\n",
              "      <td>range-1.0</td>\n",
              "      <td>personPassportNumberConstraint</td>\n",
              "      <td>None</td>\n",
              "      <td>0</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-82a066e5-ef41-4720-8a05-bda30097bac4')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-82a066e5-ef41-4720-8a05-bda30097bac4 button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-82a066e5-ef41-4720-8a05-bda30097bac4');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-1713a0dd-368f-4655-b347-ef32b4240b18\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-1713a0dd-368f-4655-b347-ef32b4240b18')\"\n",
              "            title=\"Suggest charts.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "    background-color: #E8F0FE;\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: #1967D2;\n",
              "    height: 32px;\n",
              "    padding: 0 0 0 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: #E2EBFA;\n",
              "    box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: #174EA6;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "    background-color: #3B4455;\n",
              "    fill: #D2E3FC;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart:hover {\n",
              "    background-color: #434B5C;\n",
              "    box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "    filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "    fill: #FFFFFF;\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const charts = await google.colab.kernel.invokeFunction(\n",
              "          'suggestCharts', [key], {});\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-1713a0dd-368f-4655-b347-ef32b4240b18 button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "    </div>\n",
              "  </div>\n"
            ]
          },
          "metadata": {},
          "execution_count": 15
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Loading all the data\n",
        "\n",
        "We will load 4 csv files:  \n",
        "* one for education   \n",
        "* one for employment  \n",
        "* one for travel\n",
        "* one for transaction\n",
        "\n",
        "We can see how each node is created with a label and at least one property.  \n",
        "We see all the relationships between all the nodes, we represent each transaction as a relationship between its participants.  "
      ],
      "metadata": {
        "id": "YRIKyZrkvsAh"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# Load Education data\n",
        "gds.run_cypher(\n",
        "\"\"\"\n",
        "    LOAD CSV WITH HEADERS FROM 'https://gist.githubusercontent.com/maruthiprithivi/10b456c74ba99a35a52caaffafb9d3dc/raw/a46af9c6c4bf875ded877140c112e9ff36f8f2e8/sng_education.csv' AS row\n",
        "    MERGE (person:Person {passportnumber: row.passportnumber})\n",
        "      ON CREATE SET\n",
        "        person.name = row.name\n",
        "    MERGE (institution:Institution {name: row.nameofinstitution})\n",
        "    MERGE (country:Country {name: row.country})\n",
        "    CREATE (course:Course {name: row.course})\n",
        "    MERGE (person)-[:STUDIED_AT]->(institution)\n",
        "    MERGE (institution)<-[:FROM]-(course)\n",
        "    MERGE (country)<-[:FROM]-(institution)\n",
        "    MERGE (course)<-[:MATRICULATED {year:row.startyear}]-(person)-[:GRADUATED {year:row.endyear}]->(course);\n",
        "\"\"\"\n",
        ")\n",
        "\n",
        "# Load Employment data\n",
        "gds.run_cypher(\n",
        "\"\"\"\n",
        "  LOAD CSV WITH HEADERS FROM 'https://gist.githubusercontent.com/maruthiprithivi/10b456c74ba99a35a52caaffafb9d3dc/raw/a46af9c6c4bf875ded877140c112e9ff36f8f2e8/sng_work.csv' AS row\n",
        "  MERGE (organization:Organization {designation: row.designation, organization: row.nameoforganization, startyear: row.startyear, endyear: row.endyear})\n",
        "  MERGE (country:Country {name: row.country})\n",
        "  WITH organization, country, row\n",
        "  MATCH (person:Person {passportnumber: row.passportnumber})\n",
        "  MERGE (person)-[:EMPLOYED]->(organization);\n",
        "\"\"\"\n",
        ")\n",
        "\n",
        "# Load Travel data\n",
        "gds.run_cypher(\n",
        "\"\"\"\n",
        "  LOAD CSV WITH HEADERS FROM 'https://gist.githubusercontent.com/maruthiprithivi/10b456c74ba99a35a52caaffafb9d3dc/raw/a46af9c6c4bf875ded877140c112e9ff36f8f2e8/sng_trips.csv' AS row\n",
        "  MERGE (citizenship:Country {name: row.citizenship})\n",
        "  MERGE (arrival:Country {name: row.arrivalcountry})\n",
        "  WITH  citizenship, arrival, row\n",
        "  MATCH (person:Person {passportnumber: row.passportnumber})\n",
        "  MERGE (person)-[:TRAVELLED {departuredate: row.departuredate, arrivaldate: row.arrivaldate}]->(arrival)\n",
        "  MERGE (person)-[:CITIZEN_OF]->(citizenship);\n",
        "\"\"\"\n",
        ")\n",
        "\n",
        "# Load Transaction Data\n",
        "gds.run_cypher(\n",
        "\"\"\"\n",
        "  LOAD CSV WITH HEADERS FROM 'https://gist.githubusercontent.com/maruthiprithivi/10b456c74ba99a35a52caaffafb9d3dc/raw/a46af9c6c4bf875ded877140c112e9ff36f8f2e8/sng_transaction.csv' AS row\n",
        "  MERGE (card:Card {cardnumber: row.cardnumber})\n",
        "  MERGE (country:Country {name: row.country})\n",
        "  MERGE (merchant:Merchant {name: row.merchant})\n",
        "  WITH card, country, merchant, row\n",
        "  MATCH (person:Person {passportnumber: row.passportnumber})\n",
        "  MERGE (person)-[:HAS_CARD]->(card)\n",
        "  MERGE (merchant)<-[:TRANSACTED {amount: row.amount, transactiondate: row.transactiondate}]-(card)\n",
        "  MERGE (transaction)-[:FROM]->(merchant);\n",
        "\"\"\"\n",
        ")\n"
      ],
      "metadata": {
        "id": "bNWhxzq1x6FG"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "We have now taken a series of flat data sources and constructed a rich graph representation of the connections present in the sample dataset. At this point we have the following data model :\n",
        "\n",
        "\n",
        "<img src=\"graph_schema.png\" alt=\"Initial graph data model\" width=\"75%\"  title=\"Initial Graph Data Model\">  \n"
      ],
      "metadata": {
        "id": "yNP04DOUy3v-"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Graph Exploration with Cypher using Neo4j Web Browser\n",
        "P.S: ***Switch to Neo4j Web Browser***\n",
        "\n",
        "Copy and run the queries below in Neo4j Web Browser\n",
        "\n",
        "---\n",
        "\n",
        "#### **Basic information retrieval from the Graph**\n",
        "\n",
        "---\n",
        "\n",
        "#### Retrieve Nodes/Vertex of a specific \"Label\"\n",
        "\n",
        "> Question: Retrieve all Person Node\n",
        "\n",
        "> Solution: `MATCH (p:Person) RETURN p;`\n",
        "\n",
        "\n",
        "#### Retrieve specific properties of a Node/Vertex\n",
        "\n",
        "> Question: Retrieve name and passport number of Person Nodes\n",
        "\n",
        "> Solution: `MATCH (p:Person) RETURN p.name as Name, p.passportnumber as PassportNumber;`\n",
        "\n",
        "\n",
        "#### Retrieve a specific Node/Vertex using a specific property\n",
        "\n",
        "> Question: Retrieve a Person Node with a specific passport number of GHI5678JKL\n",
        "\n",
        "> Solution: `MATCH (p:Person {passportnumber: \"GHI5678JKL\"}) RETURN p;`\n",
        "\n",
        "\n",
        "#### Rerieve Relationship/Edge of a specific \"Type\"\n",
        "> Question: Retrieve all \"EMPLOYED\" Relationship/Edge | Since Relationships/Edges can only exist between two Nodes/Vertices, we will also retrieve the Nodes/Vertices that are connected to the Relationship/Edge\n",
        "\n",
        "> Solution: `MATCH (p)-[r:EMPLOYED]->(o) RETURN p, r, o; `\n",
        "\n",
        "#### Retrieve specific properties of a Relationship/Edge\n",
        "> Question: Retrieve the arrival and departure dates of the \"TRAVELLED\" Relationship/Edge\n",
        "\n",
        "> `MATCH ()-[r:TRAVELLED]->() RETURN r.arrivaldate as ArrivalDate, r.departuredate as DepartureDate;`\n",
        "\n",
        "\n",
        "---\n",
        "\n",
        "#### **Graph Traversals**\n",
        "\n",
        "---\n",
        "\n",
        "#### Traverse the Graph using a specific Node/Vertex Label as the starting point and retrieve all the Nodes/Vertices that are connected to it by One Degree away.\n",
        "> Question: Retreive all the relationships and nodes that are connected to \"Institution\" Nodes by One Degree away in either directions\n",
        "\n",
        "> Solution: `MATCH (i:Institution)-[r]-(n) RETURN i, r, n;`\n",
        "\n",
        "*Note*: You might have noticed that there are a lot more Relationships/Vertices that are connecting the First degree Nodes/Vertices of the \"Institution\" Nodes.\n",
        "When you are doing Graph Traversals, you can also specify the direction and the path of the Traversal.\n",
        "\n",
        "\n",
        "#### Perform a direction specific traversal from the \"Institution\" Nodes\n",
        "> Question: Retreive all the OUTGOING relationships and nodes that are connected to \"Institution\" Nodes\n",
        "\n",
        "> Solution: `MATCH (i:Institution)-[r]->(n) RETURN i, r, n;`\n",
        "\n",
        "#### Perform a Relationship/Vertex type specific traversal from the \"Institution\" Nodes\n",
        "> Question: Retreive all the nodes that are connected to \"Institution\" Nodes via the STUDENT_AT relationship\n",
        "\n",
        "> Solution: `MATCH (i:Institution)-[r:STUDIED_AT]-(n) RETURN i, r, n;`"
      ],
      "metadata": {
        "id": "XQKEMYA47HyS"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Graph Exploration with Cypher using Collab Notebook"
      ],
      "metadata": {
        "id": "_6Xaow6UeGm7"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# @title Find out the countries that each person travelled to\n",
        "# Retrieve Nodes/Vertex of a specific \"Label\"\n",
        "gds.run_cypher(\n",
        "\"\"\"\n",
        "MATCH (p:Person)-[:TRAVELLED]->(c:Country)\n",
        "RETURN p.name as `Person Name`, c.name as `Country Name`\n",
        "\"\"\"\n",
        ")"
      ],
      "metadata": {
        "cellView": "form",
        "id": "Hp9NyL4i7XeZ"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# @title Find out if there are any common travel destination between the Person nodes\n",
        "gds.run_cypher(\n",
        "\"\"\"\n",
        "MATCH (p:Person)-[t:TRAVELLED]->(c:Country)\n",
        "RETURN c.name as `Country Name`, t.arrivaldate as `Arrival Date` ,COLLECT(p.name) as `Person Name`\n",
        "ORDER BY `Arrival Date`\n",
        "\"\"\"\n",
        ")"
      ],
      "metadata": {
        "cellView": "form",
        "id": "8i7Q7n5rTV_J"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# @title Find out the transaction history at specific Merchants for each Person node { display-mode: \"form\" }\n",
        "gds.run_cypher(\n",
        "\"\"\"\n",
        "MATCH (p:Person)-[:HAS_CARD]->(:Card)-[:TRANSACTED]->(m:Merchant)\n",
        "RETURN p.name as `Person Name`, m.name as `Merchant Name`\n",
        "\"\"\"\n",
        ")\n"
      ],
      "metadata": {
        "id": "O4Md4vxwUcK5"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# @title Find out if there are any common point of transaction between the Person nodes { display-mode: \"form\" }\n",
        "gds.run_cypher(\n",
        "\"\"\"\n",
        "MATCH (p:Person)-[:HAS_CARD]->(:Card)-[t:TRANSACTED]->(m:Merchant)\n",
        "RETURN m.name as `Merchant Name`, t.transactiondate as `Transaction Date`, COLLECT(p.name) as `Person Name`\n",
        "\"\"\"\n",
        ")"
      ],
      "metadata": {
        "id": "rD3dDLHGkhxn"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "#### **Graph Projection using Graph Data Science**\n",
        "\n",
        "Using Eigenvector centrality algorithm to find out the most influential institution\n",
        "\n",
        "Note: *High eigenvector score means that a node is connected to many nodes who themselves have high scores*\n",
        "\n"
      ],
      "metadata": {
        "id": "P5ACMb2bpIt4"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# My first graph project name to use eigenvenctor centrality algorithm\n",
        "graphName = 'influentialInstitution'\n",
        "\n",
        "# Remove existing projection with the same name, in case of a re run of the notebook\n",
        "if gds.graph.exists(graphName).exists:\n",
        "    gds.graph.drop(gds.graph.get(graphName))\n",
        "\n",
        "graph, project_result = gds.graph.project(\n",
        "  'influentialInstitution', # Nodes to be added in the projection\n",
        "  [\"Person\",\"Institution\"], # Relationships to be added in the projection\n",
        "  [\"STUDIED_AT\"]\n",
        ")"
      ],
      "metadata": {
        "id": "8Np9ly0Rob7m"
      },
      "execution_count": 54,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# This means that Smart National University of Vietnam is highly centralized and connected to other nodes with high score.\n",
        "gds.run_cypher(\n",
        "\"\"\"\n",
        "CALL gds.eigenvector.stream('influentialInstitution')\n",
        "YIELD nodeId, score\n",
        "RETURN gds.util.asNode(nodeId).name AS name, score\n",
        "ORDER BY score DESC, name ASC LIMIT 10\n",
        "\"\"\"\n",
        ")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 363
        },
        "id": "4VJ8oppJoPDf",
        "outputId": "8049d37d-d971-46b2-e6a3-c51cf19eb629"
      },
      "execution_count": 46,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "                                    name     score\n",
              "0   Smart National University of Vietnam  0.696676\n",
              "1                Baranagar Middle School  0.239056\n",
              "2           Bukit Panjang Primary School  0.239056\n",
              "3                  Maju Secondary School  0.239056\n",
              "4                   Raika Primary School  0.239056\n",
              "5  Sekolah Menengah Kebangsaan Chung Hua  0.239056\n",
              "6    Sekolah Rendah Kebangsaan Peringgit  0.239056\n",
              "7         St George’s Junior High School  0.239056\n",
              "8         St George’s Senior High School  0.239056\n",
              "9                 Temasek Junior College  0.239056"
            ],
            "text/html": [
              "\n",
              "  <div id=\"df-222037f0-6eea-44b8-9409-d9b76396d99e\" class=\"colab-df-container\">\n",
              "    <div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>name</th>\n",
              "      <th>score</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>Smart National University of Vietnam</td>\n",
              "      <td>0.696676</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>Baranagar Middle School</td>\n",
              "      <td>0.239056</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>Bukit Panjang Primary School</td>\n",
              "      <td>0.239056</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>Maju Secondary School</td>\n",
              "      <td>0.239056</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>Raika Primary School</td>\n",
              "      <td>0.239056</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>Sekolah Menengah Kebangsaan Chung Hua</td>\n",
              "      <td>0.239056</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>Sekolah Rendah Kebangsaan Peringgit</td>\n",
              "      <td>0.239056</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>St George’s Junior High School</td>\n",
              "      <td>0.239056</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>St George’s Senior High School</td>\n",
              "      <td>0.239056</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>Temasek Junior College</td>\n",
              "      <td>0.239056</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>\n",
              "    <div class=\"colab-df-buttons\">\n",
              "\n",
              "  <div class=\"colab-df-container\">\n",
              "    <button class=\"colab-df-convert\" onclick=\"convertToInteractive('df-222037f0-6eea-44b8-9409-d9b76396d99e')\"\n",
              "            title=\"Convert this dataframe to an interactive table.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "  <svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\" viewBox=\"0 -960 960 960\">\n",
              "    <path d=\"M120-120v-720h720v720H120Zm60-500h600v-160H180v160Zm220 220h160v-160H400v160Zm0 220h160v-160H400v160ZM180-400h160v-160H180v160Zm440 0h160v-160H620v160ZM180-180h160v-160H180v160Zm440 0h160v-160H620v160Z\"/>\n",
              "  </svg>\n",
              "    </button>\n",
              "\n",
              "  <style>\n",
              "    .colab-df-container {\n",
              "      display:flex;\n",
              "      gap: 12px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert {\n",
              "      background-color: #E8F0FE;\n",
              "      border: none;\n",
              "      border-radius: 50%;\n",
              "      cursor: pointer;\n",
              "      display: none;\n",
              "      fill: #1967D2;\n",
              "      height: 32px;\n",
              "      padding: 0 0 0 0;\n",
              "      width: 32px;\n",
              "    }\n",
              "\n",
              "    .colab-df-convert:hover {\n",
              "      background-color: #E2EBFA;\n",
              "      box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "      fill: #174EA6;\n",
              "    }\n",
              "\n",
              "    .colab-df-buttons div {\n",
              "      margin-bottom: 4px;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert {\n",
              "      background-color: #3B4455;\n",
              "      fill: #D2E3FC;\n",
              "    }\n",
              "\n",
              "    [theme=dark] .colab-df-convert:hover {\n",
              "      background-color: #434B5C;\n",
              "      box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "      filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "      fill: #FFFFFF;\n",
              "    }\n",
              "  </style>\n",
              "\n",
              "    <script>\n",
              "      const buttonEl =\n",
              "        document.querySelector('#df-222037f0-6eea-44b8-9409-d9b76396d99e button.colab-df-convert');\n",
              "      buttonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "\n",
              "      async function convertToInteractive(key) {\n",
              "        const element = document.querySelector('#df-222037f0-6eea-44b8-9409-d9b76396d99e');\n",
              "        const dataTable =\n",
              "          await google.colab.kernel.invokeFunction('convertToInteractive',\n",
              "                                                    [key], {});\n",
              "        if (!dataTable) return;\n",
              "\n",
              "        const docLinkHtml = 'Like what you see? Visit the ' +\n",
              "          '<a target=\"_blank\" href=https://colab.research.google.com/notebooks/data_table.ipynb>data table notebook</a>'\n",
              "          + ' to learn more about interactive tables.';\n",
              "        element.innerHTML = '';\n",
              "        dataTable['output_type'] = 'display_data';\n",
              "        await google.colab.output.renderOutput(dataTable, element);\n",
              "        const docLink = document.createElement('div');\n",
              "        docLink.innerHTML = docLinkHtml;\n",
              "        element.appendChild(docLink);\n",
              "      }\n",
              "    </script>\n",
              "  </div>\n",
              "\n",
              "\n",
              "<div id=\"df-a8fbe066-d8a6-4cf2-b75f-ea246cd783fa\">\n",
              "  <button class=\"colab-df-quickchart\" onclick=\"quickchart('df-a8fbe066-d8a6-4cf2-b75f-ea246cd783fa')\"\n",
              "            title=\"Suggest charts.\"\n",
              "            style=\"display:none;\">\n",
              "\n",
              "<svg xmlns=\"http://www.w3.org/2000/svg\" height=\"24px\"viewBox=\"0 0 24 24\"\n",
              "     width=\"24px\">\n",
              "    <g>\n",
              "        <path d=\"M19 3H5c-1.1 0-2 .9-2 2v14c0 1.1.9 2 2 2h14c1.1 0 2-.9 2-2V5c0-1.1-.9-2-2-2zM9 17H7v-7h2v7zm4 0h-2V7h2v10zm4 0h-2v-4h2v4z\"/>\n",
              "    </g>\n",
              "</svg>\n",
              "  </button>\n",
              "\n",
              "<style>\n",
              "  .colab-df-quickchart {\n",
              "    background-color: #E8F0FE;\n",
              "    border: none;\n",
              "    border-radius: 50%;\n",
              "    cursor: pointer;\n",
              "    display: none;\n",
              "    fill: #1967D2;\n",
              "    height: 32px;\n",
              "    padding: 0 0 0 0;\n",
              "    width: 32px;\n",
              "  }\n",
              "\n",
              "  .colab-df-quickchart:hover {\n",
              "    background-color: #E2EBFA;\n",
              "    box-shadow: 0px 1px 2px rgba(60, 64, 67, 0.3), 0px 1px 3px 1px rgba(60, 64, 67, 0.15);\n",
              "    fill: #174EA6;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart {\n",
              "    background-color: #3B4455;\n",
              "    fill: #D2E3FC;\n",
              "  }\n",
              "\n",
              "  [theme=dark] .colab-df-quickchart:hover {\n",
              "    background-color: #434B5C;\n",
              "    box-shadow: 0px 1px 3px 1px rgba(0, 0, 0, 0.15);\n",
              "    filter: drop-shadow(0px 1px 2px rgba(0, 0, 0, 0.3));\n",
              "    fill: #FFFFFF;\n",
              "  }\n",
              "</style>\n",
              "\n",
              "  <script>\n",
              "    async function quickchart(key) {\n",
              "      const charts = await google.colab.kernel.invokeFunction(\n",
              "          'suggestCharts', [key], {});\n",
              "    }\n",
              "    (() => {\n",
              "      let quickchartButtonEl =\n",
              "        document.querySelector('#df-a8fbe066-d8a6-4cf2-b75f-ea246cd783fa button');\n",
              "      quickchartButtonEl.style.display =\n",
              "        google.colab.kernel.accessAllowed ? 'block' : 'none';\n",
              "    })();\n",
              "  </script>\n",
              "</div>\n",
              "    </div>\n",
              "  </div>\n"
            ]
          },
          "metadata": {},
          "execution_count": 46
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# @title Find out which Person node studied in Smart National University of Vietnam { display-mode: \"form\" }\n",
        "gds.run_cypher(\n",
        "\"\"\"\n",
        "MATCH (p:Person)-[:STUDIED_AT]->(i:Institution { name: \"Smart National University of Vietnam\"})\n",
        "RETURN p.name\n",
        "\"\"\"\n",
        ")"
      ],
      "metadata": {
        "id": "hzbneXoytR3Z"
      },
      "execution_count": null,
      "outputs": []
    }
  ]
}